app/controllers/semesters_controller.rb

    def home
        @semesters = Semester.order(:year)
---
SELECT "semesters".* FROM "semesters" ORDER BY "semesters"."year" ASC

    def show
        session[:return_to] ||= request.referer
        @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def create
        @semester = Semester.new(semester_params)

        if params[:student_csv].present?
            @semester.student_csv.attach(params[:student_csv])
        end

        if params[:client_csv].present?
            @semester.client_csv.attach(params[:client_csv])
        end

        if params[:git_csv].present?
            @semester.git_csv.attach(params[:git_csv])
        end

        if @semester.save
---
INSERT INTO "semesters" ("year", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2024], ["semester", "Spring"], ["created_at", "2024-02-03 04:43:56.062823"], ["updated_at", "2024-02-03 04:43:56.062823"]]
INSERT INTO "semesters" ("year", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2024], ["semester", "Fall"], ["created_at", "2024-02-26 00:30:08.127426"], ["updated_at", "2024-02-26 00:30:08.127426"]]
INSERT INTO "semesters" ("year", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["year", 2024], ["semester", "Fall"], ["created_at", "2024-02-24 23:54:59.514503"], ["updated_at", "2024-02-24 23:54:59.514503"]]

    def edit
        session[:return_to] ||= request.referer
        @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def update
        @semester = Semester.find(params[:id])
        if @semester.update(params.require(:semester).permit(:semester, :year, :student_csv, :client_csv, :git_csv))
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "semesters" SET "updated_at" = $1 WHERE "semesters"."id" = $2  [["updated_at", "2024-02-27 21:11:01.019514"], ["id", 6]]

    def destroy
        @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def team
        @semester = Semester.find(params[:semester_id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]